JosAlc67/DimecaProject/esp32_triple_as5600/Fase8_Cinematica/Fase8_Cinematica.ino
bool leerReg16_bus3(uint8_t reg, uint16_t &valor) {
  i2c3.beginTransmission(AS5600_ADDR);
  i2c3.write(reg);
  if (i2c3.endTransmission(false) != 0) return false;
  size_t n = i2c3.requestFrom((uint8_t)AS5600_ADDR, (size_t)2, true);
  if (n != 2) return false;
  uint8_t hi = i2c3.read();
  uint8_t lo = i2c3.read();
  valor = ((uint16_t)hi << 8) | lo;
  return true;
}

bool leerReg8_bus3(uint8_t reg, uint8_t &valor) {
  i2c3.beginTransmission(AS5600_ADDR);
  i2c3.write(reg);
  if (i2c3.endTransmission(false) != 0) return false;
  size_t n = i2c3.requestFrom((uint8_t)AS5600_ADDR, (size_t)1, true);
  if (n != 1) return false;
  valor = i2c3.read();
  return true;
}

// Lectura del angulo (registro 0x0E, con offset de calibracion aplicado)
// del sensor #3. Es el camino RAPIDO, sin leer el registro de estado, para
// no cargar el bus por software durante la actualizacion de cada iteracion
// de loop(). El estado del iman se revisa aparte, solo al imprimir.
bool leerAnguloConOffset_bus3(uint16_t &raw) {
  uint16_t v;
  if (!leerReg16_bus3(AS5600_REG_ANGLE, v)) return false;
  raw = ((v & 0x0FFF) + offsetRaw3) & 0x0FFF;
  return true;
}

bool leerAS5600_3(uint16_t &raw, bool &imanOk) {
  if (!leerAnguloConOffset_bus3(raw)) return false;
  uint8_t stReg = 0;
  imanOk = leerReg8_bus3(AS5600_REG_STATUS, stReg) && (stReg & AS5600_STATUS_MD);
  return true;
}

// ---------------- Seguimiento de vueltas completas (multi-turn) ----------------
//
// Para el sensor #3 se replica a mano el mismo algoritmo que usa
// AS5600::getCumulativePosition()/getRevolutions() en la libreria de
// RobTillaart (verificado en su codigo fuente): compara la lectura actual
// contra la anterior, y si el salto es mayor a media vuelta (2048 cuentas
// de 4096), asume que se cruzo la frontera 0/4095 y suma o resta una
// vuelta completa segun el sentido.

int32_t  posicionAcum3        = 0;
int16_t  ultimaPosicion3      = 0;
bool     primeraLectura3      = true;
uint32_t tiempoUltimaLectura3 = 0;

// Cota de velocidad fisicamente plausible del eje, con margen holgado
// sobre lo medido en CALVEL/PID a duty maximo (unas decenas de deg/s).
// Se usa SOLO para filtrar lecturas corruptas del bus #3: a diferencia
// de #1/#2 (I2C por hardware), el #3 es bit-banged por software, sin CRC
// ni filtro de glitches, y mucho mas sensible al ruido electrico que
// meten los BTS7960 al conmutar PWM cerca del cable. Una sola lectura
// corrupta que "parezca" un salto de mas de media vuelta se tomaba antes
// como una vuelta completa real (+-4096 cuentas, +-360 grados) de golpe,
// corrompiendo el acumulado permanentemente - eso es lo que producia el
// desfase de decenas de grados visto en las pruebas con Motor 3, peor
// mientras mas rapido/largo giraba (mas lecturas por I2C software en
// ese tramo = mas chance de que alguna saliera corrupta).
const float VELOCIDAD_MAX_PLAUSIBLE_DEG_S = 150.0f;

// La libreria oficial de RobTillaart (usada para #1/#2), ante un fallo I2C,
// NO reporta error de inmediato: reutiliza internamente el ultimo angulo
// bueno leido y sigue - un solo tropiezo transitorio del bus no interrumpe
// nada. Replicamos ese mismo criterio de tolerancia aqui: solo despues de
// varios fallos SEGUIDOS se reporta "sin comunicacion" de verdad. Sin esto,
// un solo glitch transitorio del bus #3 (mas propenso a esto por ser
// bit-banged por software) abortaba de golpe un PID o HOME activo en Motor
// 3, aunque el sensor siguiera funcionando bien el ciclo siguiente.
uint8_t fallosConsecutivos3 = 0;
const uint8_t MAX_FALLOS_CONSECUTIVOS_BUS3 = 5;

bool actualizarPosicion3() {
  uint16_t raw;
  if (!leerAnguloConOffset_bus3(raw)) {
    fallosConsecutivos3++;
    return (fallosConsecutivos3 < MAX_FALLOS_CONSECUTIVOS_BUS3);
  }
  fallosConsecutivos3 = 0;
  int16_t value = (int16_t)raw;

  uint32_t ahora = micros();

  if (primeraLectura3) {
    ultimaPosicion3 = value;
    tiempoUltimaLectura3 = ahora;
    primeraLectura3 = false;
    return true;
  }

  int32_t deltaBruto;
  if ((ultimaPosicion3 > 2048) && (value < (ultimaPosicion3 - 2048))) {
    deltaBruto = 4096 - ultimaPosicion3 + value;      // vuelta completa CW
  } else if ((value > 2048) && (ultimaPosicion3 < (value - 2048))) {
    deltaBruto = -4096 - ultimaPosicion3 + value;     // vuelta completa CCW
  } else {
    deltaBruto = value - ultimaPosicion3;
  }

  float dtSeg = (ahora - tiempoUltimaLectura3) / 1000000.0f;
  float velocidadImplicada = fabs((float)deltaBruto) * (360.0f / 4096.0f) / max(dtSeg, 0.0001f);

  if (velocidadImplicada > VELOCIDAD_MAX_PLAUSIBLE_DEG_S) {
    // Lectura descartada: el salto implica una velocidad imposible para
    // este motor, casi seguro ruido del bus. No se toca ultimaPosicion3
    // ni posicionAcum3 (se reintenta con la siguiente lectura); comOk3
    // sigue en true porque la transaccion I2C en si no fallo.
    return true;
  }

  posicionAcum3 += deltaBruto;
  ultimaPosicion3 = value;
  tiempoUltimaLectura3 = ahora;
  return true;
}

int32_t revoluciones3() {
  int32_t p = posicionAcum3 >> 12; // dividir por 4096
  if (p < 0) p++;                  // corrige el redondeo de numeros negativos
  return p;
}

// Fija la posicion acumulada actual como punto de partida `nuevaPosicion`
// (normalmente 0), resincronizando tambien la referencia interna para que
// el proximo actualizarPosicion3() no calcule un salto falso.
void resetPosicionAcumulada3(int32_t nuevaPosicion) {
  uint16_t raw;
  leerAnguloConOffset_bus3(raw);
  ultimaPosicion3 = (int16_t)raw;
  tiempoUltimaLectura3 = micros();
  posicionAcum3 = nuevaPosicion;
}

// Actualizacion RAPIDA del conteo de vueltas de los 3 encoders. Se llama en
// cada iteracion de loop() (no solo cuando toca imprimir), porque si el eje
// gira mas de media vuelta entre dos actualizaciones el algoritmo pierde la
// cuenta. TAMBIEN se llama explicitamente despues de cualquier delay()
// bloqueante (por ejemplo en medirVelocidadGrados()), porque mientras
// loop() esta bloqueado esta actualizacion no ocurre sola.
void actualizarEncoders() {
  as5600_1.getCumulativePosition(true);
  comOk1 = (as5600_1.lastError() == 0);

