JosAlc67/DimecaProject/esp32_triple_as5600/Fase8_Cinematica/Fase8_Cinematica.ino
  if (velTiempoAnterior != 0) {
    float dtSeg = (ahora - velTiempoAnterior) / 1000.0f;
    for (uint8_t m = 0; m < 3; m++) {
      int32_t posActual = leerPosicionAcumRaw(m);
      float instantanea = (posActual - velPosAnterior[m]) * (360.0f / 4096.0f) / dtSeg;
      velocidadEstimadaDegS[m] = VELOCIDAD_EMA_ALFA * instantanea + (1.0f - VELOCIDAD_EMA_ALFA) * velocidadEstimadaDegS[m];
      velPosAnterior[m] = posActual;
    }
  } else {
    for (uint8_t m = 0; m < 3; m++) velPosAnterior[m] = leerPosicionAcumRaw(m);
  }
  velTiempoAnterior = ahora;
}

// Guarda en flash la posicion acumulada actual del encoder del motor `m`,
// para poder restaurarla en el proximo arranque (ver setup()).
void guardarPosicionMotor(uint8_t m) {
  guardarPosicionAcum(m + 1, leerPosicionAcumRaw(m));
}

void detenerMotor(uint8_t m) {
  escribirPWM(PIN_RPWM[m], canalRPWM(m), 0);
  escribirPWM(PIN_LPWM[m], canalLPWM(m), 0);
  estadoMotor[m] = PARADO;
  guardarPosicionMotor(m);
  Serial.print("Motor ");
  Serial.print(m + 1);
  Serial.println(": DETENIDO");
}

void girarAdelante(uint8_t m) {
  if (pidActivo[m]) {
    Serial.println("RECHAZADO: PID activo en este motor, manda S primero.");
    return;
  }
  if (estadoMotor[m] != PARADO) {
    Serial.println("RECHAZADO: detén el motor (S) antes de cambiar de sentido.");
    return;
  }
  escribirPWM(PIN_LPWM[m], canalLPWM(m), 0);
  escribirPWM(PIN_RPWM[m], canalRPWM(m), velocidadMotor[m]);
  estadoMotor[m] = ADELANTE;
  Serial.print("Motor ");
  Serial.print(m + 1);
  Serial.println(": GIRANDO ADELANTE (baja velocidad)");
}

void girarReversa(uint8_t m) {
  if (pidActivo[m]) {
    Serial.println("RECHAZADO: PID activo en este motor, manda S primero.");
    return;
  }
  if (estadoMotor[m] != PARADO) {
    Serial.println("RECHAZADO: detén el motor (S) antes de cambiar de sentido.");
    return;
  }
  escribirPWM(PIN_RPWM[m], canalRPWM(m), 0);
  escribirPWM(PIN_LPWM[m], canalLPWM(m), velocidadMotor[m]);
  estadoMotor[m] = REVERSA;
  Serial.print("Motor ");
  Serial.print(m + 1);
  Serial.println(": GIRANDO REVERSA (baja velocidad)");
}

// ---------------- CALVEL: calibracion de velocidad entre motores ----------------
//
// A igual duty, los 3 motores no giran necesariamente a la misma velocidad
// real (friccion, tolerancias de fabricacion, etc). CALVEL mide con el
// propio encoder cuantos grados/segundo gira cada motor a su duty actual,
// y ajusta el duty de cada uno (de forma proporcional, asumiendo relacion
// aproximadamente lineal duty<->velocidad en este rango) para que los 3
// terminen girando a una velocidad similar a la del motor mas lento -no
// se puede acelerar un motor mas alla de lo que ya da a duty 255, asi que
// siempre se iguala hacia abajo, nunca hacia arriba.
//
// Esto es calibracion de lazo abierto (se mide una vez, se fija un duty
// nuevo y listo) - no es control de velocidad en tiempo real ni PID.

// 3000ms (antes 1500ms): con una ventana corta, el transitorio de arranque
// (fraccion de segundo hasta alcanzar velocidad estable) pesa demasiado en
// la medicion y da resultados poco repetibles entre corridas (~10% de
// variacion observada en hardware con 1.5s). Una ventana mas larga diluye
// ese transitorio y promedia mejor cualquier variacion de corto plazo.
const uint32_t CALVEL_DURACION_MS = 3000;

// Gira el motor `m` hacia adelante durante `duracionMs` y devuelve la
// velocidad medida en grados/segundo (valor absoluto). Requiere que el
// motor este detenido antes de llamar.
//
// Usa un sondeo periodico (actualizarEncoders() cada 20ms) en vez de un
// solo delay() largo: si se usara un delay() bloqueante único con una
// ventana larga, y el motor llegara a girar mas de media vuelta durante
// esa espera, el algoritmo de deteccion de vuelta se confundiria (el
// mismo riesgo que ya se resolvio para loop() en general, aqui reaparece
// si la ventana de medicion es larga y no se refresca seguido).
float medirVelocidadGrados(uint8_t m, uint32_t duracionMs) {
  actualizarEncoders(); // asegura que "antes" sea una lectura fresca
  int32_t antes = leerPosicionAcumRaw(m);
  girarAdelante(m);

  uint32_t inicio = millis();
  while (millis() - inicio < duracionMs) {
    actualizarEncoders();
    delay(20);
  }

  detenerMotor(m);
  int32_t despues = leerPosicionAcumRaw(m);

  float gradosRecorridos = fabs((float)(despues - antes)) * (360.0f / 4096.0f);
  return gradosRecorridos / (duracionMs / 1000.0f);
}

void calibrarVelocidades() {
  for (uint8_t i = 0; i < 3; i++) {
    if (estadoMotor[i] != PARADO) {
      Serial.println("RECHAZADO: los 3 motores deben estar detenidos (S/SS) antes de CALVEL.");
      return;
    }
  }

  Serial.println("Calibrando velocidades... (gira cada motor por turnos, unos segundos)");

  float velocidad[3];
  for (uint8_t i = 0; i < 3; i++) {
    velocidad[i] = medirVelocidadGrados(i, CALVEL_DURACION_MS);
    Serial.print("Motor ");
    Serial.print(i + 1);
    Serial.print(": duty=");
    Serial.print(velocidadMotor[i]);
    Serial.print(" -> ");
    Serial.print(velocidad[i], 2);
    Serial.println(" deg/s medidos");
  }

  float velocidadObjetivo = velocidad[0];
  for (uint8_t i = 1; i < 3; i++) {
    if (velocidad[i] < velocidadObjetivo) velocidadObjetivo = velocidad[i];
  }

  Serial.print("Velocidad objetivo (la del motor mas lento): ");
  Serial.print(velocidadObjetivo, 2);
  Serial.println(" deg/s");

  for (uint8_t i = 0; i < 3; i++) {
    if (velocidad[i] <= 0.01f) {
      Serial.print("Motor ");
      Serial.print(i + 1);
      Serial.println(": ADVERTENCIA - velocidad medida ~0, no se ajusta (revisa el motor).");
      continue;
    }
    float factor = velocidadObjetivo / velocidad[i];
    int16_t nuevaDuty = (int16_t)round(velocidadMotor[i] * factor);
    if (nuevaDuty < DUTY_MIN_SEGURO) {
      Serial.print("Motor ");
      Serial.print(i + 1);
      Serial.print(": el duty calculado (");
      Serial.print(nuevaDuty);
      Serial.print(") es menor al minimo seguro (");
      Serial.print(DUTY_MIN_SEGURO);
      Serial.println("), se deja en el minimo - este motor seguira algo mas rapido que los otros.");
      nuevaDuty = DUTY_MIN_SEGURO;
    }
    if (nuevaDuty > 255) nuevaDuty = 255;

    velocidadMotor[i] = (uint8_t)nuevaDuty;
    guardarVelocidadMotor(i + 1, nuevaDuty);
    Serial.print("Motor ");
    Serial.print(i + 1);
    Serial.print(": duty ajustado a ");
    Serial.print(nuevaDuty);
    Serial.println(" (guardado en flash).");
  }

  Serial.println("Calibracion de velocidad terminada. Puedes correr CALVEL de nuevo para refinar.");
}

// Variante manual: "CALVEL M<1-3> <duty>". En vez de tomar como objetivo
// la velocidad del motor mas lento, mide el motor `motorRef` EXACTAMENTE
// al duty `dutyRef` que se le indique, usa esa velocidad medida como
// objetivo fijo, y ajusta los otros dos motores para acercarse a ella.
// El motor de referencia queda fijado en `dutyRef` (no se recalcula).
void calibrarVelocidadesConReferencia(uint8_t motorRef, uint8_t dutyRef) {
  for (uint8_t i = 0; i < 3; i++) {
    if (estadoMotor[i] != PARADO) {
      Serial.println("RECHAZADO: los 3 motores deben estar detenidos (S/SS) antes de CALVEL.");
      return;
    }
  }

  Serial.print("Calibrando con referencia: Motor ");
  Serial.print(motorRef + 1);
  Serial.print(" fijado a duty ");
  Serial.println(dutyRef);

  velocidadMotor[motorRef] = dutyRef;
  float velocidadObjetivo = medirVelocidadGrados(motorRef, CALVEL_DURACION_MS);
  guardarVelocidadMotor(motorRef + 1, dutyRef);
  Serial.print("Motor ");
  Serial.print(motorRef + 1);
  Serial.print(" (referencia): duty=");
  Serial.print(dutyRef);
  Serial.print(" -> ");
  Serial.print(velocidadObjetivo, 2);
  Serial.println(" deg/s medidos. Esa es la velocidad objetivo para los otros dos.");

  for (uint8_t i = 0; i < 3; i++) {
    if (i == motorRef) continue; // ya quedo fijo, no se recalcula

    float velocidadMedida = medirVelocidadGrados(i, CALVEL_DURACION_MS);
    Serial.print("Motor ");
    Serial.print(i + 1);
    Serial.print(": duty=");
    Serial.print(velocidadMotor[i]);
    Serial.print(" -> ");
    Serial.print(velocidadMedida, 2);
    Serial.println(" deg/s medidos");

    if (velocidadMedida <= 0.01f) {
      Serial.print("Motor ");
      Serial.print(i + 1);
      Serial.println(": ADVERTENCIA - velocidad medida ~0, no se ajusta (revisa el motor).");
      continue;
    }

    float factor = velocidadObjetivo / velocidadMedida;
    int32_t nuevaDuty = (int32_t)round((float)velocidadMotor[i] * factor);

    if (nuevaDuty > 255) {
      Serial.print("Motor ");
      Serial.print(i + 1);
      Serial.println(": ADVERTENCIA - ni siquiera a duty 255 alcanza la velocidad de referencia. Se deja en 255 (quedara mas lento que el objetivo).");
      nuevaDuty = 255;
    } else if (nuevaDuty < DUTY_MIN_SEGURO) {
      Serial.print("Motor ");
      Serial.print(i + 1);
      Serial.print(": el duty calculado (");
      Serial.print(nuevaDuty);
      Serial.print(") es menor al minimo seguro (");
      Serial.print(DUTY_MIN_SEGURO);
      Serial.println("), se deja en el minimo - este motor seguira algo mas rapido que el objetivo.");
      nuevaDuty = DUTY_MIN_SEGURO;
    }

    velocidadMotor[i] = (uint8_t)nuevaDuty;
    guardarVelocidadMotor(i + 1, (int16_t)nuevaDuty);
    Serial.print("Motor ");
    Serial.print(i + 1);
    Serial.print(": duty ajustado a ");
    Serial.print(nuevaDuty);
    Serial.println(" (guardado en flash).");
  }

  Serial.println("Calibracion con referencia terminada.");
}

