JosAlc67/DimecaProject/esp32_triple_as5600/Fase8_Cinematica/Fase8_Cinematica.ino
// NOTA sobre R_CABLE_MM=1mm: con este radio, el cambio de longitud de cable
// por grado de theta es muy chico (para theta=90 deg, deltaL maximo es
// apenas ~1.6mm) - o sea el rango de setpoints de motor que produce esto es
// pequeño en comparacion con lo que un PID individual (PIDn) puede mover.
// Vale la pena confirmar visualmente en la prueba de los 4 casos cardinales
// (ver el plan) que el doblez resultante es el esperado en magnitud - si se
// siente demasiado chico para el theta pedido, la medida de R_CABLE_MM es
// sospechosa de estar mal tomada (posible mm vs cm) y hay que re-verificarla
// antes de seguir.

// Calcula los 3 setpoints de motor (grados) para un doblez (theta, phi)
// dados, dejando el resultado en setpoints[3]. Aplica los limites fisicos
// de cable (L_MAX_RECOGER_MM / L_MAX_SOLTAR_MM) por seguridad - si theta
// pide mas cable del que hay margen, se recorta ahi (no se aborta).
void calcularSetpointsCinematica(float theta_deg, float phi_deg, float setpoints[3]) {
  float theta_rad = theta_deg * (PI / 180.0f);
  float phi_rad = phi_deg * (PI / 180.0f);

  for (uint8_t i = 0; i < 3; i++) {
    float phi_i_rad = PHI_CABLE_DEG[i] * (PI / 180.0f);
    float deltaL_mm = -theta_rad * R_CABLE_MM * cosf(phi_rad - phi_i_rad);

    if (deltaL_mm < -L_MAX_RECOGER_MM) deltaL_mm = -L_MAX_RECOGER_MM;
    if (deltaL_mm > L_MAX_SOLTAR_MM) deltaL_mm = L_MAX_SOLTAR_MM;

    setpoints[i] = (deltaL_mm / R_CARRETE_MM) * (180.0f / PI);
  }
}

// Comando BEND <theta_deg> <phi_deg>: calcula los setpoints y activa el PID
// de los 3 motores a la vez. Requiere los 3 motores detenidos (mismo
// criterio que CALVEL) - si alguno esta en HOME o PID activo, iniciarPID()
// ya rechaza individualmente con su propio mensaje.
void iniciarCinematica(float theta_deg, float phi_deg) {
  float setpoints[3];
  calcularSetpointsCinematica(theta_deg, phi_deg, setpoints);

  Serial.print("BEND theta=");
  Serial.print(theta_deg, 2);
  Serial.print(" deg | phi=");
  Serial.print(phi_deg, 2);
  Serial.print(" deg -> setpoints: M1=");
  Serial.print(setpoints[0], 2);
  Serial.print(" | M2=");
  Serial.print(setpoints[1], 2);
  Serial.print(" | M3=");
  Serial.println(setpoints[2], 2);

  for (uint8_t m = 0; m < 3; m++) iniciarPID(m, setpoints[m]);
}

// Imprime el estado de los 3 encoders bajo demanda (comando STATUS), en vez
// de hacerlo automaticamente cada cierto tiempo - eso generaba demasiado
// ruido visual en el Monitor Serial.
void imprimirEstadoCompleto() {
  bool imanOk1 = comOk1 && as5600_1.magnetDetected();
  bool imanOk2 = comOk2 && as5600_2.magnetDetected();
  uint8_t st3 = 0;
  bool imanOk3 = comOk3 && leerReg8_bus3(AS5600_REG_STATUS, st3) && (st3 & AS5600_STATUS_MD);

  imprimirPosicion("AS5600 #1", comOk1, as5600_1.getCumulativePosition(false), as5600_1.getRevolutions(), imanOk1);
  imprimirPosicion("AS5600 #2", comOk2, as5600_2.getCumulativePosition(false), as5600_2.getRevolutions(), imanOk2);
  imprimirPosicion("AS5600 #3", comOk3, posicionAcum3, revoluciones3(), imanOk3);

  Serial.print("Velocidad actual (deg/s) -> M1: ");
  Serial.print(velocidadEstimadaDegS[0], 2);
  Serial.print(" | M2: ");
  Serial.print(velocidadEstimadaDegS[1], 2);
  Serial.print(" | M3: ");
  Serial.println(velocidadEstimadaDegS[2], 2);

  for (uint8_t m = 0; m < 3; m++) {
    if (!pidActivo[m]) continue;
    float actual;
    leerAnguloAcumuladoGrados(m, actual);
    Serial.print("Motor ");
    Serial.print(m + 1);
    Serial.print(": PID activo | setpoint=");
    Serial.print(pidSetpoint[m], 2);
    Serial.print(" deg | actual=");
    Serial.print(actual, 2);
    Serial.print(" deg | error=");
    Serial.print(pidSetpoint[m] - actual, 2);
    Serial.println(" deg");
  }
  Serial.println("---");
}

void procesarComando(String cmd) {
  cmd.trim();
  cmd.toUpperCase();

  if (cmd == "M1") { motorActivo = 0; Serial.println("Motor activo: 1"); }
  else if (cmd == "M2") { motorActivo = 1; Serial.println("Motor activo: 2"); }
  else if (cmd == "M3") { motorActivo = 2; Serial.println("Motor activo: 3"); }
  else if (cmd == "F") girarAdelante(motorActivo);
  else if (cmd == "R") girarReversa(motorActivo);
  else if (cmd == "S") { homingActivo[motorActivo] = false; pidActivo[motorActivo] = false; detenerMotor(motorActivo); }
  else if (cmd == "SS") {
    for (uint8_t i = 0; i < 3; i++) { homingActivo[i] = false; pidActivo[i] = false; detenerMotor(i); }
    Serial.println("PARADA DE EMERGENCIA: los 3 motores detenidos.");
  }
  else if (cmd == "CAL1") calibrarSensor(1);
  else if (cmd == "CAL2") calibrarSensor(2);
  else if (cmd == "CAL3") calibrarSensor(3);
  else if (cmd == "HOME1") iniciarHoming(0);
  else if (cmd == "HOME2") iniciarHoming(1);
  else if (cmd == "HOME3") iniciarHoming(2);
  else if (cmd == "HOME") {
    for (uint8_t i = 0; i < 3; i++) iniciarHoming(i);
  }
  else if (cmd == "STATUS") imprimirEstadoCompleto();
  else if (cmd == "CALVEL") calibrarVelocidades();
  else if (cmd.startsWith("CALVEL ")) {
    // Formato: CALVEL M<1-3> <duty 0-255>. Ejemplo: CALVEL M3 225
    String resto = cmd.substring(7);
    resto.trim();
    int espacio = resto.indexOf(' ');
    bool formatoValido = false;
    if (espacio > 0) {
      String parteMotor = resto.substring(0, espacio);
      String parteDuty = resto.substring(espacio + 1);
      parteMotor.trim();
      parteDuty.trim();
      if (parteMotor.length() == 2 && parteMotor.charAt(0) == 'M') {
        int numMotor = parteMotor.substring(1).toInt();
        int duty = parteDuty.toInt();
        if (numMotor >= 1 && numMotor <= 3 && duty >= 0 && duty <= 255) {
          formatoValido = true;
          calibrarVelocidadesConReferencia((uint8_t)(numMotor - 1), (uint8_t)duty);
        }
      }
    }
    if (!formatoValido) {
      Serial.println("Formato invalido. Usa: CALVEL M<1-3> <duty 0-255>. Ejemplo: CALVEL M3 225");
    }
  }
  else if (cmd.startsWith("PID1 ")) iniciarPID(0, cmd.substring(5).toFloat());
  else if (cmd.startsWith("PID2 ")) iniciarPID(1, cmd.substring(5).toFloat());
  else if (cmd.startsWith("PID3 ")) iniciarPID(2, cmd.substring(5).toFloat());
  else if (cmd.startsWith("SETVEL1 ")) fijarVelocidadMotor(0, (uint8_t)constrain(cmd.substring(8).toInt(), 0, 255));
  else if (cmd.startsWith("SETVEL2 ")) fijarVelocidadMotor(1, (uint8_t)constrain(cmd.substring(8).toInt(), 0, 255));
  else if (cmd.startsWith("SETVEL3 ")) fijarVelocidadMotor(2, (uint8_t)constrain(cmd.substring(8).toInt(), 0, 255));
  else if (cmd.startsWith("BEND ")) {
    // Formato: BEND <theta_deg> <phi_deg>. Ejemplo: BEND 15 90
    String resto = cmd.substring(5);
    resto.trim();
    int espacio = resto.indexOf(' ');
    if (espacio > 0) {
      float theta = resto.substring(0, espacio).toFloat();
      float phi = resto.substring(espacio + 1).toFloat();
      iniciarCinematica(theta, phi);
    } else {
      Serial.println("Formato invalido. Usa: BEND <theta_deg> <phi_deg>. Ejemplo: BEND 15 90");
    }
  }
  else if (cmd.length() > 0) {
    Serial.println("Comando no reconocido. Usa: M1 M2 M3 F R S SS CAL1 CAL2 CAL3 HOME1 HOME2 HOME3 HOME STATUS CALVEL CALVEL M<1-3> <duty> SETVEL1/2/3 <duty> PID1/2/3 <setpoint_deg> BEND <theta_deg> <phi_deg>");
  }
}

// ---------------- Programa principal ----------------

const uint32_t CHECKPOINT_INTERVALO_MS = 60000; // respaldo de posicion cada 60s
uint32_t ultimoCheckpoint = 0;

void setup() {
  Serial.begin(115200);
  delay(500);
  Serial.println();
  Serial.println("=== Fase 8: cinematica (PCC, 3 cables a 120 deg) sobre PID identificado ===");

  Wire.begin(21, 22);
  Wire.setClock(400000);
  Serial.println(as5600_1.begin() ? "OK: AS5600 #1" : "ERROR: AS5600 #1 no responde al iniciar");

  Wire1.begin(32, 33);
  Wire1.setClock(400000);
  Serial.println(as5600_2.begin() ? "OK: AS5600 #2" : "ERROR: AS5600 #2 no responde al iniciar");

  i2c3.begin(4, 13, 100000);
  uint16_t rawTest;
  bool imanTest;
  Serial.println(leerAS5600_3(rawTest, imanTest) ? "OK: AS5600 #3" : "ERROR: AS5600 #3 no responde al iniciar");

  // Restaura offsets de calibracion guardados en flash (si existen).
  int16_t off1 = cargarOffsetRaw(1);
  int16_t off2 = cargarOffsetRaw(2);
  offsetRaw3    = cargarOffsetRaw(3);
  as5600_1.setOffset(off1 * AS5600_RAW_TO_DEGREES);
  as5600_2.setOffset(off2 * AS5600_RAW_TO_DEGREES);
  Serial.print("Offsets cargados de flash -> #1: ");
  Serial.print(off1);
  Serial.print(" | #2: ");
  Serial.print(off2);
  Serial.print(" | #3: ");
  Serial.println(offsetRaw3);

  // Restaura la posicion acumulada guardada en flash (si existe) en vez de
  // reiniciar siempre en 0, para que "0" siga siendo el mismo punto fisico
  // entre reinicios/apagados. Esto asume que el eje no se movio a mano
  // mientras el ESP32 estaba apagado (el AS5600 es un sensor relativo para
  // el conteo de vueltas, no puede detectar movimiento sin alimentacion).
  // resetCumulativePosition()/resetPosicionAcumulada3() tambien resincronizan
  // la referencia interna con la posicion FISICA real actual, evitando que
  // la primera lectura interprete un salto falso.
  int32_t pos1 = cargarPosicionAcum(1);
  int32_t pos2 = cargarPosicionAcum(2);
  int32_t pos3 = cargarPosicionAcum(3);
  as5600_1.resetCumulativePosition(pos1);
  as5600_2.resetCumulativePosition(pos2);
  resetPosicionAcumulada3(pos3);
  Serial.print("Posicion restaurada de flash (cuentas RAW) -> #1: ");
  Serial.print(pos1);
  Serial.print(" | #2: ");
  Serial.print(pos2);
  Serial.print(" | #3: ");
  Serial.println(pos3);

  // Restaura el duty por motor calibrado con CALVEL (150 por defecto si
  // nunca se calibro).
  velocidadMotor[0] = (uint8_t)cargarVelocidadMotor(1);
  velocidadMotor[1] = (uint8_t)cargarVelocidadMotor(2);
  velocidadMotor[2] = (uint8_t)cargarVelocidadMotor(3);
  Serial.print("Duty por motor cargado de flash -> #1: ");
  Serial.print(velocidadMotor[0]);
  Serial.print(" | #2: ");
  Serial.print(velocidadMotor[1]);
  Serial.print(" | #3: ");
  Serial.println(velocidadMotor[2]);

  for (uint8_t i = 0; i < 3; i++) {
#if CORE_LEDC_V3
    configurarPWM(PIN_RPWM[i], 0);
    configurarPWM(PIN_LPWM[i], 0);
#else
    configurarPWM(PIN_RPWM[i], CANAL_RPWM[i]);
    configurarPWM(PIN_LPWM[i], CANAL_LPWM[i]);
#endif
    detenerMotor(i); // arranca siempre detenido
  }

  Serial.println();
  Serial.println("Comandos: M1 M2 M3 (seleccionar motor) | F (adelante) | R (reversa) | S (detener) | SS (parada de emergencia)");
  Serial.println("Calibracion: CAL1 CAL2 CAL3 -> fija 0 deg en la posicion fisica actual de ese eje (persiste en flash)");
  Serial.println("HOME: HOME1 HOME2 HOME3 (un motor) | HOME (los 3 a la vez) -> regreso a 0 en lazo cerrado, sin PID");
  Serial.println("STATUS -> imprime el angulo/vueltas y la velocidad actual (deg/s) de los 3 encoders (ya no se imprime solo, para no saturar el Monitor Serial)");
  Serial.println("CALVEL -> mide y empareja la velocidad real de los 3 motores contra el mas lento (requiere los 3 detenidos, persiste en flash)");
  Serial.println("CALVEL M<1-3> <duty> -> igual, pero fija el motor indicado a ese duty y usa su velocidad como objetivo. Ej: CALVEL M3 225");
  Serial.println("SETVEL1/SETVEL2/SETVEL3 <duty> -> fija a mano el duty de ese motor (sin medir), persiste en flash. Ej: SETVEL2 122");
  Serial.println("PID1/PID2/PID3 <setpoint_deg> -> activa el PID real (ganancias identificadas) en ese motor, con ese setpoint. Ej: PID2 45.0");
  Serial.println("BEND <theta_deg> <phi_deg> -> dobla el segmento theta grados hacia la direccion phi (modelo PCC, 3 cables a 120), activa el PID de los 3 motores. Ej: BEND 15 90");
  Serial.println("Motor activo por defecto: 1.");
  Serial.println();

  ultimoCheckpoint = millis();
}

void loop() {
  if (Serial.available()) {
    String linea = Serial.readStringUntil('\n');
    procesarComando(linea);
  }

  actualizarEncoders();
  actualizarVelocidadEstimada();

  // Avanza el homing (si esta activo) de cada motor, tambien en cada
  // iteracion de loop() para reaccionar rapido si hay que abortar.
  actualizarHoming(0);
  actualizarHoming(1);
  actualizarHoming(2);

  // Avanza el PID (si esta activo) de cada motor. actualizarPID() se
  // autolimita a PID_INTERVALO_MS, es seguro llamarla en cada iteracion.
  actualizarPID(0);
  actualizarPID(1);
  actualizarPID(2);

  // Respaldo periodico en flash, por si el ESP32 pierde alimentacion
  // mientras un motor sigue en movimiento (detenerMotor() ya guarda al
  // detenerse, esto es solo la red de seguridad para ese caso puntual).
  uint32_t ahora = millis();
  if (ahora - ultimoCheckpoint >= CHECKPOINT_INTERVALO_MS) {
    ultimoCheckpoint = ahora;
    for (uint8_t i = 0; i < 3; i++) guardarPosicionMotor(i);
  }
}
